In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
Series

pandas.core.series.Series

In [3]:
DataFrame

pandas.core.frame.DataFrame

In [4]:
num_list = [100, 200, 300]
num_series = Series(num_list)

In [5]:
num_list

[100, 200, 300]

In [6]:
num_series

0    100
1    200
2    300
dtype: int64

In [7]:
list(num_series)

[100, 200, 300]

In [8]:
num_series = Series([100, 200, 300])

In [9]:
num_series

0    100
1    200
2    300
dtype: int64

In [10]:
num_list

[100, 200, 300]

In [11]:
for i in range(len(num_list)):
    num_list[i] += 1

In [12]:
num_list

[101, 201, 301]

In [13]:
num_series

0    100
1    200
2    300
dtype: int64

In [14]:
num_series + 1

0    101
1    201
2    301
dtype: int64

In [15]:
num_list

[101, 201, 301]

In [16]:
num_list * 2

[101, 201, 301, 101, 201, 301]

In [17]:
num_series * 2

0    200
1    400
2    600
dtype: int64

In [18]:
[3, 4] + [5, 6]

[3, 4, 5, 6]

In [19]:
Series([3, 4]) + Series([5, 6])

0     8
1    10
dtype: int64

In [20]:
Series([3,4]) + 1

0    4
1    5
dtype: int64

In [21]:
Series([3, 4]) + Series([5, 6, 7, 8])

0     8.0
1    10.0
2     NaN
3     NaN
dtype: float64

In [22]:
s = Series([10, 20, 90, 80, 30])

In [23]:
s

0    10
1    20
2    90
3    80
4    30
dtype: int64

In [24]:
s == 30

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [25]:
s = Series([11, 22, 99, 88, 33])
s

0    11
1    22
2    99
3    88
4    33
dtype: int64

In [26]:
mod = s % 2

In [27]:
mod

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [28]:
mod == 1

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [29]:
s

0    11
1    22
2    99
3    88
4    33
dtype: int64

In [30]:
s % 2 == 1

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [31]:
x = Series([100, 200, 300])
x

0    100
1    200
2    300
dtype: int64

In [32]:
y = Series([100, 200, 300], index=[1, 2, 0])
y

1    100
2    200
0    300
dtype: int64

In [33]:
z = Series([10, 20, 30])

In [34]:
x + z

0    110
1    220
2    330
dtype: int64

In [35]:
y + z

0    310
1    120
2    230
dtype: int64

In [36]:
x

0    100
1    200
2    300
dtype: int64

In [37]:
x[0]

100

In [38]:
x[1]

200

In [39]:
x[:2]

0    100
1    200
dtype: int64

In [40]:
x[1:]

1    200
2    300
dtype: int64

In [41]:
x[-2:]

1    200
2    300
dtype: int64

In [42]:
s = Series([11, 22, 99, 88, 33])

In [43]:
s

0    11
1    22
2    99
3    88
4    33
dtype: int64

In [44]:
b = Series([True, True, False, False, False])
b

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [45]:
s[b]

0    11
1    22
dtype: int64

In [46]:
s

0    11
1    22
2    99
3    88
4    33
dtype: int64

In [47]:
s[Series([True, False, False, True, True])]

0    11
3    88
4    33
dtype: int64

In [48]:
b

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [49]:
s

0    11
1    22
2    99
3    88
4    33
dtype: int64

In [50]:
b = s % 2 == 1
b

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [51]:
s[b]

0    11
2    99
4    33
dtype: int64

In [52]:
s[s % 2 == 1]

0    11
2    99
4    33
dtype: int64

In [53]:
names = Series(["alice", "bob", "cindy"])
scores = Series([140, 150, 160])
data = {"name": names, "scores": scores}
table = DataFrame(data)
table

    name  scores
0  alice     140
1    bob     150
2  cindy     160

In [54]:
# extracting a column
table["name"]

0    alice
1      bob
2    cindy
Name: name, dtype: object

In [56]:
sum(table["scores"])

450

In [57]:
table

    name  scores
0  alice     140
1    bob     150
2  cindy     160

In [58]:
table.loc[2]

name      cindy
scores      160
Name: 2, dtype: object

In [59]:
table.loc[2,"name"]

'cindy'

In [62]:
table.loc[2,"scores"] = 500

In [63]:
table

    name  scores
0  alice     140
1    bob     150
2  cindy     500

In [66]:
m = pd.read_csv("IMDB-Movie-Data.csv")

In [67]:
m.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [69]:
ratings = m["Rating"]

sum(ratings) / len(ratings)

In [70]:
sum(ratings) / len(ratings)

6.723446893787578

In [71]:
m.describe()

            Index         Year     Runtime      Rating
count  998.000000   998.000000  998.000000  998.000000
mean   498.500000  2012.779559  113.170341    6.723447
std    288.242086     3.207549   18.828877    0.945682
min      0.000000  2006.000000   66.000000    1.900000
25%    249.250000  2010.000000  100.000000    6.200000
50%    498.500000  2014.000000  111.000000    6.800000
75%    747.750000  2016.000000  123.000000    7.400000
max    997.000000  2016.000000  191.000000    9.000000